iwasz/mcuxsdk-middleware-bootloader/targets/MIMXRT1166/src/semc_nand_flash_MIMXRT1166.c
/*
 * Copyright 2017 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include "fsl_semc.h"
#include "semc_nand_flash.h"
#include "crc16.h"
#include "microseconds.h"
#include "bootloader.h"

////////////////////////////////////////////////////////////////////////////////
// Definitions
////////////////////////////////////////////////////////////////////////////////

#define NAND_SPARE_AREA_MAX_SIZE (256U)
#define NAND_ECC_MAX_BLOCKS (32U)

#define NAND_READY_CHECK_INTERVAL_NORMAL (0U)
#define NAND_MAX_FEATURE_ACCESS_TIME_tFEAT_US (1000U)
#define NAND_MAX_READ_PARAMETER_PAGE_TIME_tR_US (1000U)
#define NAND_FIRST_CMD_CHANGE_COLUMN_SETUP_TIME_NS (500U)
#define NAND_MAX_RST_TIME0_tRST_US (5U)
#define NAND_MAX_RST_TIME1_tRST_US (10U)
#define NAND_MAX_RST_TIME2_tRST_US (500U)
#define NAND_MAX_RST_TIME3_tRST_US (1000U)

#define NAND_ONFI_SIGNATURE_MIN_MATCHED_BYTES (0x2U)

//!@brief Parallel NAND Flash information
enum _nand_manufactory_information
{
    kNandDeviceInfo_BadBlockMark_x8 = 0x00U,
    kNandDeviceInfo_BadBlockMark_x16 = 0x0000U,
    kNandDeviceInfo_NonBadBlockMark_x8 = 0xFFU,
    kNandDeviceInfo_NonBadBlockMark_x16 = 0xFFFFU,
};

//!@brief Parallel NAND ONFI status bit mask
enum _nand_onfi_status_bit
{
    kNandDeviceSR_ONFI_PassBitMask = 0x01U,
    kNandDeviceSR_ONFI_ReadyBitMask = 0x40U, // R/B#
};

//!@brief NAND command set selection
enum _nand_command_set_selection
{
    kNandDeviceCmdSet_OnfiCompliant = 0x00U, // As Micron MT29Fxx
    kNandDeviceCmdSet_OnfiLike = 0x01U,      // As Toshiba TC58xx
    kNandDeviceCmdSet_Specific = 0x02U,      // As Samsung K9F12xx
};

//!@brief Parallel NAND Flash commands
enum _nand_onfi_command_set
{
    // Must-have command
    kNandDeviceCmd_ONFI_Reset = 0xFFU,
    kNandDeviceCmd_ONFI_ReadMode = 0x00U,
    kNandDeviceCmd_ONFI_ReadID = 0x90U,
    kNandDeviceCmd_ONFI_ReadParameterPage = 0xECU,
    kNandDeviceCmd_ONFI_ReadStatus = 0x70U,
    kNandDeviceCmd_ONFI_ReadPageSetup = 0x00U,
    kNandDeviceCmd_ONFI_ReadPageConfirm = 0x30U,
    kNandDeviceCmd_ONFI_ChangeReadColumnSetup = 0x05U,
    kNandDeviceCmd_ONFI_ChangeReadColumnConfirm = 0xE0U,
    kNandDeviceCmd_ONFI_EraseBlockSetup = 0x60U,
    kNandDeviceCmd_ONFI_EraseBlockConfirm = 0xD0U,
    kNandDeviceCmd_ONFI_ProgramPageSetup = 0x80U,
    kNandDeviceCmd_ONFI_ProgramPageConfirm = 0x10U,
    // Optional command
    kNandDeviceCmd_ONFI_ReadStatusEnhanced = 0x78U,
    kNandDeviceCmd_ONFI_SetFeatures = 0xEFU,
    kNandDeviceCmd_ONFI_GetFeatures = 0xEEU,
};

enum _nand_specific_command_set
{
    kNandDeviceCmd_SPEC_ReadStatusMultiPlane = 0x71U,
    kNandDeviceCmd_SPEC_ReadPage1stHalf = 0x00U,
    kNandDeviceCmd_SPEC_ReadPage2ndHalf = 0x01U,
    kNandDeviceCmd_SPEC_ReadPageSpare = 0x50U,
};

//!@brief Parallel NAND feature info
enum __nand_onfi_feature_info
{
    kNandDeviceFeature_ONFI_TimingModeAddress = 0x01U,

    kNandDeviceFeature_ONFI_TimingModeCode_Mode0 = 0x00U,
    kNandDeviceFeature_ONFI_TimingModeCode_Mode1 = 0x01U,
    kNandDeviceFeature_ONFI_TimingModeCode_Mode2 = 0x02U,
    kNandDeviceFeature_ONFI_TimingModeCode_Mode3 = 0x03U,
    kNandDeviceFeature_ONFI_TimingModeCode_Mode4 = 0x04U,
    kNandDeviceFeature_ONFI_TimingModeCode_Mode5 = 0x05U,
};

enum __nand_spec_feature_info
{
    kNandDeviceFeature_MT29F_ArrayOperationModeAddress = 0x90U,

    kNandDeviceFeature_MT29F_ArrayOperationModeCode_DisableECC = 0x00u,
    kNandDeviceFeature_MT29F_ArrayOperationModeCode_EnableECC = 0x08u,
};

//!@brief Parallel NAND ONFI feature config
typedef struct __nand_onfi_feature_config
{
    uint8_t command;
    uint16_t address;
    uint8_t parameter[4];
    uint8_t reserved[2];
} nand_onfi_feature_config_t;

//!@brief ONFI config block tag
enum __nand_onfi_tags
{
    //! @brief Tag value used to validate the ONFI parameter config block.
    kNandOnfiTag = FOUR_CHAR_CODE('O', 'N', 'F', 'I'),
};

//!@brief NAND Device Write Type
enum __nand_write_type
{
    kNandDeviceWritePage = 0u,
    kNandDeviceSetFeature = 1u,
};

//!@brief NAND Device Read Type
enum __nand_read_type
{
    kNandDeviceReadPageData = 0u,
    kNandDeviceAccessFeature = 0u,
    kNandDeviceReadParameter = 1u,
    kNandDeviceReadID = 1u,
};

//!@brief Parallel NAND ONFI id config
typedef struct __nand_onfi_id_config
{
    uint8_t mid; // manufacturer ID, assigned by JEDEC
    uint8_t did; // device ID for the part, assigned by the manufacturer
} nand_onfi_id_config_t;

//!@brief Parallel NAND ONFI parameter config
typedef struct __nand_onfi_parameter_config
{
    // Revision information and features block
    uint32_t signature;      //!< [0x000-0x003]
    uint16_t revisionNumber; //!< [0x004-0x005]
    struct
    {
        uint16_t x16bitDataBusWidth : 1;
        uint16_t multipleLUNoperations : 1;
        uint16_t reserved : 14;
    } supportedFeatures; //!< [0x006-0x007]
    struct
    {
        uint16_t reserved0 : 2;
        uint16_t setGetfeatures : 1;
        uint16_t readStatusEnhanced : 1;
        uint16_t reserved1 : 12;
    } optionalCommands;    //!< [0x008-0x009]
    uint8_t reserved0[22]; //!< [0x00a-0x01f]
    // Manufacturer information block
    uint8_t deviceManufacturer[12]; //!< [0x020-0x02b]
    uint8_t deviceModel[20];        //!< [0x02c-0x03f]
    uint8_t JEDECid;                //!< [0x040-0x040]
    uint8_t dataCode[2];            //!< [0x041-0x042]
    uint8_t reserved1[13];          //!< [0x043-0x04f]
    // Memory organization block
    uint32_t dataBytesPerPage;  //!< [0x050-0x053]
    uint16_t spareBytesPerPage; //!< [0x054-0x055]
    uint8_t reserved2[6];       //!< [0x056-0x05b]
    uint32_t pagesPerBlock;     //!< [0x05c-0x05f]
    uint32_t blocksPerLUN;      //!< [0x060-0x063]
    uint8_t LUNsPerDevice;      //!< [0x064-0x064]
    union
    {
        uint8_t addressCycles;
        struct
        {
            uint8_t rowAddressCycles : 4;
            uint8_t columnAddressCycles : 4;
        } addressCyclesStr;
    };                     //!< [0x065-0x065]
    uint8_t reserved3[26]; //!< [0x066-0x07f]
    // Electrical parameters block
    uint8_t reserved4; //!< [0x080-0x080]
    struct
    {
        uint8_t mode0 : 1;
        uint8_t mode1 : 1;
        uint8_t mode2 : 1;
        uint8_t mode3 : 1;
        uint8_t mode4 : 1;
        uint8_t mode5 : 1;
        uint8_t reserved : 2;
    } timingMode;                            //!< [0x081-0x081]
    uint8_t reserved5[3];                    //!< [0x082-0x084]
    uint8_t maxPageProgramTimeInUs[2];       //!< [0x085-0x086]
    uint8_t maxBlockEraseTimeInUs[2];        //!< [0x087-0x088]
    uint8_t maxPageReadTimeInUs[2];          //!< [0x089-0x08a]
    uint8_t minChangeColunmSetupTimeInNs[2]; //!< [0x08b-0x08c]
    uint8_t reserved6[23];                   //!< [0x08d-0x0a3]
    // Vendor block
    uint16_t vendorSpecificRevisionNumber; //!< [0x0a4-0x0a5]
    uint8_t reserved7[88];                 //!< [0x0a6-0x0fd]
    uint16_t integrityCRC;                 //!< [0x0fe-0x0ff]
                                           // Redundant Parameter Pages
    // uint8_t redundantParameterPage[2][256];       //!< [0x100-0x2ff]
} nand_onfi_parameter_config_t;

//!@brief Parallel NAND program process option
typedef enum _nand_program_process
{
    kNandDeviceProgramProcess_Pre = 0x00U,
    kNandDeviceProgramProcess_Post = 0x01U,
} nand_program_process_t;

//!@brief Parallel NAND read spare process option
typedef enum _nand_read_spare_process
{
    kNandDeviceReadSpareProcess_Pre = 0x00U,
    kNandDeviceReadSpareProcess_Post = 0x01U,
} nand_read_spare_process_t;

//!@brief Parallel NAND AC timing option
typedef enum _nand_ac_timing_set_option
{
    kNandAcTimingSetOption_Basic = 0x00U,
    kNandAcTimingSetOption_Advanced = 0x01U,
} nand_ac_timing_set_option_t;

//!@brief Parallel NAND Ready check use case
typedef enum _nand_ready_check_use_case
{
    kNandReadyCheckUseCase_DuringCommand = 0x00U,
    kNandReadyCheckUseCase_BeforeRead = 0x01U,
} nand_ready_check_use_case_t;

//!@brief Parallel NAND AC cycle option
typedef enum _nand_ac_cycle_set_option
{
    kNandAcCycleSetOption_Min = 0x00U,
    kNandAcCycleSetOption_Max = 0x01U,
} nand_ac_cycle_set_option_t;

//!@brief Parallel NAND spare uint (8-byte)
typedef struct __nand_8byte_spare_unit
{
    uint16_t badBlockMark;
    uint8_t userMetadata[2];
    uint32_t eccParityData;
} nand_8byte_spare_unit_t;

