iwasz/mcuxsdk-middleware-bootloader/targets/MIMXRT1166/src/semc_nand_flash_MIMXRT1166.c
//!@brief Parallel NAND page spare area
typedef struct __nand_page_spare_area
{
    nand_8byte_spare_unit_t unit8Byte[NAND_ECC_MAX_BLOCKS];
} nand_page_spare_area_t;

//!@brief Common ECC parity data
typedef struct __nand_comm_ecc_parity_data
{
    uint32_t block[NAND_ECC_MAX_BLOCKS];
} nand_comm_ecc_parity_data_t;

//!@brief Parallel NAND operation info
typedef struct __nand_operation_info
{
    uint8_t commandSet;
    uint8_t onfiAcTimingModeCode;
    uint8_t reserved[2];
    uint32_t rowAddressToGetSR;
    uint32_t pageReadTimeInUs_tR;
    uint32_t pageReadTimeInUs_tR_ECC;
    uint32_t PageProgramTimeInUs_tPROG;
    uint32_t blockEraseTimeInUs_tBERS;
    uint32_t changeColumnSetupTimeInNs_tCCS;
    bool isFeatureCommandSupport;
    bool isBlankSpareArea;
} nand_operation_info_t;

////////////////////////////////////////////////////////////////////////////////
// Local prototypes
////////////////////////////////////////////////////////////////////////////////

static status_t semc_nand_issue_reset(semc_nand_config_t *config);
static status_t semc_nand_issue_read_mode(semc_nand_config_t *config);
static status_t semc_nand_issue_access_feature(semc_nand_config_t *config, uint8_t *featureConfig);
static status_t semc_nand_issue_read_parameter(semc_nand_config_t *config,
                                               nand_onfi_parameter_config_t *parameterConfig);
static status_t semc_nand_issue_erase_block(semc_nand_config_t *config, uint32_t ipgCmdAddr);
static status_t semc_nand_issue_program_page(semc_nand_config_t *config,
                                             uint32_t ipgCmdAddr,
                                             nand_program_process_t process);
static status_t semc_nand_issue_read_status(semc_nand_config_t *config, uint8_t *SR);
static status_t semc_nand_issue_read_page(semc_nand_config_t *config, uint32_t ipgCmdAddr);
static status_t semc_nand_issue_read_page_spare(semc_nand_config_t *config, uint32_t ipgCmdAddr);
static status_t semc_nand_issue_change_read_column(semc_nand_config_t *config, uint32_t ipgCmdAddr);

/* Calculate min AC timing cycle for SEMC according to AC time*/
static uint8_t semc_nand_get_specific_ac_cycles(semc_nand_config_t *config,
                                                nand_ac_cycle_set_option_t acSetOption,
                                                uint32_t requiredTime_ns,
                                                uint8_t bitWidth);
/* Set all AC timing cycle of SEMC according to list of AC time*/
static void semc_nand_set_ac_timing_parameter(semc_nand_config_t *config, nand_ac_timing_set_option_t acSetOption);
/* Adjust AC timing cycle tCCS/tWHR parameter if needed*/
static void semc_nand_adjust_timing_parameter_ccs(semc_nand_config_t *config);
/* Switch to use new timing mode for device*/
static status_t semc_nand_switch_device_timing_mode(semc_nand_config_t *config);
/* Read onfi parameter data from device and make use of them*/
static status_t semc_nand_make_use_of_onfi_parameter(semc_nand_config_t *config);
/* Check the device ready status*/
static status_t semc_nand_wait_for_ready(semc_nand_config_t *config,
                                         uint32_t readyCheckIntervalInUs,
                                         nand_ready_check_use_case_t useCaseOption);
/* Enable the device ECC via feature setting*/
static status_t semc_nand_set_device_ecc(semc_nand_config_t *config, semc_nand_device_ecc_status_t expectedStatus);
/* Validates data by using device ECC*/
static bool semc_nand_is_device_ecc_check_passed(semc_nand_config_t *config);
/* Check if given mem range are all blank data*/
static bool semc_nand_is_mem_blank(uint32_t address, uint32_t length);
/* Pre/Post process during reading spare page*/
static status_t semc_nand_read_spare_page_process(semc_nand_config_t *config,
                                                  uint32_t ipgCmdAddr,
                                                  nand_read_spare_process_t process);
/* Get all ECC codes stored in page spare area*/
static status_t semc_nand_read_software_ecc_code_from_spare_area(semc_nand_config_t *config, uint32_t baseAddress);
/* Validates data by using Software ECC*/
static bool semc_nand_is_software_ecc_check_passed(semc_nand_config_t *config, uint32_t baseAddress);
/* Writes calculated ecc data in device spare area*/
static status_t semc_nand_write_ecc_data_in_spare_area(semc_nand_config_t *config,
                                                       uint32_t baseAddress,
                                                       uint8_t *nandData,
                                                       uint32_t length);

////////////////////////////////////////////////////////////////////////////////
// Variables
////////////////////////////////////////////////////////////////////////////////

//! @brief Readback buffer for nand.
static uint8_t s_nandReadbackBlockBuffer[NAND_ECC_MAX_BLOCK_SIZE];
static nand_comm_ecc_parity_data_t s_nandCommEccParityData;
static nand_operation_info_t s_nandOperationInfo;
static nand_onfi_parameter_config_t s_nandOnfiParameterConfig;
static nand_onfi_id_config_t s_nandOnfiIdConfig;

const nand_ac_timing_parameter_cycle_t s_nandAcTimingParameterTable[] = {
    // User-Defined
    { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    // ONFI 1.0, mode 0, 10MHz, 100ns
    {.CEITV = 0,
     .TA = 0,
     .REH = 4,
     .REL = 8, // REL = (tRP > tREA) ? tRP : tREA
     .WEH = 4,
     .WEL = 8,
     .CEH = 0,
     .CES = 1,
     .TWB = 33,
     .TRR = 6,
     .TADL = 33,
     .TRHW = 33,
     .TWHR = 33 },
    { 0, 0, 2, 4, 2, 4, 0, 1, 16, 3, 33, 16, 33 }, // ONFI1.0, mode 1, 20MHz, 50ns, tRP or tREA
    { 0, 0, 2, 4, 2, 2, 0, 1, 16, 3, 33, 16, 33 }, // ONFI1.0, mode 2, 28MHz, 35ns, tREA 4
    { 0, 0, 1, 3, 1, 2, 0, 1, 16, 3, 33, 16, 33 }, // ONFI1.0, mode 3, 33MHz, 30ns, tREA 3
    { 0, 0, 1, 2, 1, 1, 0, 1, 16, 3, 33, 16, 33 }, // ONFI1.0, mode 4, 40MHz, 25ns, tREA 2
    { 0, 0, 1, 2, 1, 1, 0, 1, 16, 3, 33, 16, 33 }, // ONFI1.0, mode 5, 50MHz, 20ns, tREA 2
    // Auto-Detection
    { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
};

