iwasz/mcuxsdk-middleware-bootloader/targets/MIMXRT1166/src/semc_nand_flash_MIMXRT1166.c
        /*
         * column address bits offset is bit0 if NANDCR0.PS=0(x8)
         * column address bits offset is bit1 if NANDCR0.PS=1(x16), bit0 is always 0. so address is twice.
         */
        if (config->memConfig.nandMemConfig.ioPortWidth == 16)
        {
            featureConfig.address = 0x02;
        }

        status = semc_nand_issue_access_feature(config, (uint8_t *)&featureConfig);
        if (status != kStatus_Success)
        {
            return status;
        }

        // Get current timing mode to double check
        featureConfig.command = kNandDeviceCmd_ONFI_GetFeatures;
        featureConfig.parameter[0] = 0;
        status = semc_nand_issue_access_feature(config, (uint8_t *)&featureConfig);
        if (status != kStatus_Success)
        {
            return status;
        }
        deviceTimingMode = featureConfig.parameter[0];

        debug_printf("semc_nand_switch_device_timing_mode(): deviceTimingMode from featureConfig.parameter[0] is %d\n",
                     deviceTimingMode);
        debug_printf("semc_nand_switch_device_timing_mode(): s_nandOperationInfo.onfiAcTimingModeCode = %d\n",
                     s_nandOperationInfo.onfiAcTimingModeCode);

        if (deviceTimingMode != s_nandOperationInfo.onfiAcTimingModeCode)
        {
            return kStatus_SemcNAND_SwitchTimingModeFailure;
        }
    }

    return status;
}

static status_t semc_nand_make_use_of_onfi_parameter(semc_nand_config_t *config)
{
    status_t status = kStatus_Success;

    // Cleanup ONFI config block
    memset((uint8_t *)&s_nandOnfiParameterConfig, 0, sizeof(s_nandOnfiParameterConfig));

    // Read First ONFI parameter data from device
    status = semc_nand_issue_read_parameter(config, &s_nandOnfiParameterConfig);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Validate ONFI parameter
    // From Device Spec, To insure data integrity, device contain more than one copies of the parameter page,
    //  The Integrity CRC (Cyclic Redundancy Check) field is used to verify that the contents of the parameters page
    //  were transferred correctly to the host.
    while (1)
    {
        // Validate signature
        if (s_nandOnfiParameterConfig.signature == kNandOnfiTag)
        {
            // Validate the interity CRC
            // From ONFI spec:
            //  1. The CRC calculation covers all of data between byte 0 and byte 253 of the parameter page inclusive.
            //  2. The CRC shall be calculated on word (16-bit) quantities starting with bytes 1:0 in the parameter
            //  page.
            //  3. The CRC shall be calculated using the following 16-bit generator polynomial: G(X) = X16 + X15 + X2 +
            //  1. This polynomial in hex may be represented as 8005h.
            //  4. The CRC value shall be initialized with a value of 4F4Eh before the calculation begins.
            //  5. There is no XOR applied to the final CRC value after it is calculated.
            //  6. There is no reversal of the data bytes or the CRC calculated value.
            uint16_t calculatedCrc = 0;
            uint8_t *calculatedStart = (uint8_t *)&s_nandOnfiParameterConfig;
            uint32_t calculatedSize = sizeof(s_nandOnfiParameterConfig) - 2;

            crc16_data_t crc16Info;
            crc16_onfi_init(&crc16Info);
            crc16_onfi_update(&crc16Info, calculatedStart, calculatedSize);
            crc16_finalize(&crc16Info, &calculatedCrc);

            if (calculatedCrc == s_nandOnfiParameterConfig.integrityCRC)
            {
                break;
            }
        }

        // Read the Redundant Parameter Page data from device
        status = semc_ipg_memory_read(&config->memConfig, (uint8_t *)&s_nandOnfiParameterConfig,
                                      sizeof(nand_onfi_parameter_config_t), kNandDeviceReadParameter);
        if (status != kStatus_Success)
        {
            return status;
        }
        // From ONFI Spec: The host should determine whether an additional parameter page is present by checking the
        // first
        // Dword. If at least two out of four bytes match the parameter page signature, then an additional
        // parameter page is present.
        {
            uint32_t matchedBytes = 0;
            uint32_t nandOnfiTag = kNandOnfiTag;
            for (uint32_t i = 0; i < sizeof(s_nandOnfiParameterConfig.signature); i++)
            {
                if ((*(((uint8_t *)&nandOnfiTag) + i)) == (*(((uint8_t *)&s_nandOnfiParameterConfig.signature) + i)))
                {
                    matchedBytes++;
                }
            }
            if (matchedBytes < NAND_ONFI_SIGNATURE_MIN_MATCHED_BYTES)
            {
                return kStatus_SemcNAND_InvalidOnfiParameter;
            }
        }
    }

    // Get device vendor
    config->vendorType = kSemcNandVendorType_Unknown;
    for (uint32_t vendorIndex = kSemcNandVendorType_Micron; vendorIndex < kSemcNandVendorType_Unknown; vendorIndex++)
    {
        uint32_t ch;
        for (ch = 0; ch < sizeof(s_nandDeviceManufacturerList[vendorIndex]); ch++)
        {
            if (s_nandDeviceManufacturerList[vendorIndex][ch] != s_nandOnfiParameterConfig.deviceManufacturer[ch])
            {
                break;
            }
        }
        if (ch == sizeof(s_nandDeviceManufacturerList[vendorIndex]))
        {
            config->vendorType = vendorIndex;
            break;
        }
    }

    s_nandOperationInfo.isFeatureCommandSupport = s_nandOnfiParameterConfig.optionalCommands.setGetfeatures;
    debug_printf("isFeatureCommandSupport = %d\n", s_nandOperationInfo.isFeatureCommandSupport);

    // Set NAND feature/command info
    if (s_nandOnfiParameterConfig.optionalCommands.readStatusEnhanced)
    {
        config->statusCommandType = kSemcNandStatusCommandType_Enhanced;
    }
    else
    {
        config->statusCommandType = kSemcNandStatusCommandType_Common;
    }

    // Set new NAND memory info
    config->bytesInPageDataArea = s_nandOnfiParameterConfig.dataBytesPerPage;
    {
        uint32_t dataBytes, columnWidth;
        columnWidth = 0;
        dataBytes = config->bytesInPageDataArea;
        dataBytes >>= 1;
        while (dataBytes)
        {
            columnWidth++;
            dataBytes >>= 1;
        }
        // See Note NA1.x for reason
        if (config->memConfig.nandMemConfig.ioPortWidth == 8)
        {
            config->memConfig.nandMemConfig.columnAddressWidth = columnWidth;
        }
        else if (config->memConfig.nandMemConfig.ioPortWidth == 16)
        {
            config->memConfig.nandMemConfig.columnAddressWidth = columnWidth - 1;
        }
    }
    config->bytesInPageSpareArea = s_nandOnfiParameterConfig.spareBytesPerPage;
    config->pagesInBlock = s_nandOnfiParameterConfig.pagesPerBlock;
    config->blocksInPlane = s_nandOnfiParameterConfig.blocksPerLUN;
    config->planesInDevice = s_nandOnfiParameterConfig.LUNsPerDevice;

    debug_printf("nand model page size is %d\n", config->bytesInPageDataArea);

