iwasz/mcuxsdk-middleware-bootloader/targets/MIMXRT1166/src/semc_nand_flash_MIMXRT1166.c
    return status;
}

/* read nand ID */
status_t semc_nand_issue_read_id(semc_nand_config_t *config, nand_onfi_id_config_t *idConfig)
{
    status_t status = kStatus_Success;
    uint32_t readyCheckIntervalInUs;
    uint32_t dummyData = 0;

    uint16_t commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_ReadID, SEMC_IPCMD_NAND_AM_COL_ADDR_1BYTE,
                                                          SEMC_IPCMD_NAND_CM_IPG_CMD_ADDR);

    status = semc_ipg_command_nand_access(0, commandCode, 0, &dummyData);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Note2: ReadStatus may be used to check the status of Read Parameter Page during execution.
    // Note3: Use of the ReadStatusEnhanced command is prohibited during the power-on
    //  Reset command and when OTP mode is enabled. It is also prohibited following
    //  some of the other reset, identification, and configuration operations.
    readyCheckIntervalInUs = (NAND_MAX_READ_PARAMETER_PAGE_TIME_tR_US > s_nandOperationInfo.pageReadTimeInUs_tR) ?
                                 NAND_MAX_READ_PARAMETER_PAGE_TIME_tR_US :
                                 s_nandOperationInfo.pageReadTimeInUs_tR;
    if (config->readyCheckOption == kSemcNandReadyCheckOption_RB)
    {
        status = semc_nand_wait_for_ready(config, readyCheckIntervalInUs, kNandReadyCheckUseCase_BeforeRead);
        if (status != kStatus_Success)
        {
            return status;
        }
    }
    else
    {
        microseconds_delay(readyCheckIntervalInUs);
    }

    status = semc_ipg_memory_read(&config->memConfig, (uint8_t *)idConfig, sizeof(nand_onfi_id_config_t), kNandDeviceReadID);

    return status;
}

status_t semc_nand_issue_read_mode(semc_nand_config_t *config)
{
    status_t status = kStatus_Success;
    uint32_t dummyData = 0;

    // READ MODE command is accepted by device when it is ready (RDY = 1, ARDY = 1).
    status = semc_nand_wait_for_ready(config, NAND_READY_CHECK_INTERVAL_NORMAL, kNandReadyCheckUseCase_DuringCommand);
    if (status != kStatus_Success)
    {
        return status;
    }

    // The READ MODE command disables status output and enables data output
    uint16_t commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_ReadMode,
                                                          SEMC_IPCMD_NAND_AM_COL_ROW_ADDR,  // Don't care
                                                          SEMC_IPCMD_NAND_CM_IPG_CMD_ONLY); // Command Only
    status =
        semc_ipg_command_nand_access(config->memConfig.nandMemConfig.ipgMemBaseAddress, commandCode, 0, &dummyData);

    return status;
}

status_t semc_nand_issue_access_feature(semc_nand_config_t *config, uint8_t *featureConfig)
{
    status_t status = kStatus_Success;
    uint32_t dummyData = 0;

    // SET/GET FEATURES command is accepted by the target only when all die
    //  (LUNs) on the target are idle.
    nand_onfi_feature_config_t *nandFeatureConfig = (nand_onfi_feature_config_t *)featureConfig;
    uint16_t commandCode = semc_ipg_command_get_nand_code(nandFeatureConfig->command,
                                                          SEMC_IPCMD_NAND_AM_COL_ADDR_1BYTE, // CA1
                                                          SEMC_IPCMD_NAND_CM_IPG_CMD_ADDR);  // Commmand Address
    status = semc_ipg_command_nand_access(nandFeatureConfig->address, commandCode, 0, &dummyData);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Only ipg command is supported here
    if (nandFeatureConfig->command == kNandDeviceCmd_ONFI_SetFeatures)
    {
        status = semc_ipg_memory_write(&config->memConfig, nandFeatureConfig->parameter,
                                       sizeof(nandFeatureConfig->parameter), kNandDeviceSetFeature);
        if (status != kStatus_Success)
        {
            return status;
        }
        // Note: From Spec, both R/B and SR can be used to determine the progress,
        //    but actually only when we choose R/B, then it works well on the EVB and FPGA.
        if (config->readyCheckOption == kSemcNandReadyCheckOption_RB)
        {
            // Monitors the target's R/B# signal to determine the progress.
            status = semc_nand_wait_for_ready(config, NAND_READY_CHECK_INTERVAL_NORMAL,
                                              kNandReadyCheckUseCase_DuringCommand);
        }
        else
        {
            // Just delay some time to workaround issue
            microseconds_delay(NAND_MAX_FEATURE_ACCESS_TIME_tFEAT_US);
        }
    }
    else if (nandFeatureConfig->command == kNandDeviceCmd_ONFI_GetFeatures)
    {
        // Note: From Spec, both R/B and SR can be used to determine the progress,
        //    but actually only when we choose R/B, then it works well on the EVB and FPGA.
        if (config->readyCheckOption == kSemcNandReadyCheckOption_RB)
        {
            // Monitors the target's R/B# signal to determine the progress.
            status =
                semc_nand_wait_for_ready(config, NAND_READY_CHECK_INTERVAL_NORMAL, kNandReadyCheckUseCase_BeforeRead);
            if (status != kStatus_Success)
            {
                return status;
            }
        }
        else
        {
            // Just delay some time to workaround issue
            microseconds_delay(NAND_MAX_FEATURE_ACCESS_TIME_tFEAT_US);
        }

        status = semc_ipg_memory_read(&config->memConfig, nandFeatureConfig->parameter,
                                      sizeof(nandFeatureConfig->parameter), 1);
    }

    return status;
}

status_t semc_nand_issue_read_parameter(semc_nand_config_t *config, nand_onfi_parameter_config_t *parameterConfig)
{
    status_t status = kStatus_Success;
    uint32_t readyCheckIntervalInUs;
    uint32_t dummyData = 0;

    uint16_t commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_ReadParameterPage,
                                                          SEMC_IPCMD_NAND_AM_COL_ADDR_1BYTE, // 1 byte address
                                                          SEMC_IPCMD_NAND_CM_IPG_CMD_ADDR);  // Command Address
    status = semc_ipg_command_nand_access(0, commandCode, 0, &dummyData);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Note2: ReadStatus may be used to check the status of Read Parameter Page during execution.
    // Note3: Use of the ReadStatusEnhanced command is prohibited during the power-on
    //  Reset command and when OTP mode is enabled. It is also prohibited following
    //  some of the other reset, identification, and configuration operations.
    readyCheckIntervalInUs = (NAND_MAX_READ_PARAMETER_PAGE_TIME_tR_US > s_nandOperationInfo.pageReadTimeInUs_tR) ?
                                 NAND_MAX_READ_PARAMETER_PAGE_TIME_tR_US :
                                 s_nandOperationInfo.pageReadTimeInUs_tR;
    if (config->readyCheckOption == kSemcNandReadyCheckOption_RB)
    {
        status = semc_nand_wait_for_ready(config, readyCheckIntervalInUs, kNandReadyCheckUseCase_BeforeRead);
        if (status != kStatus_Success)
        {
            return status;
        }
    }
    else
    {
        microseconds_delay(readyCheckIntervalInUs);
    }

