iwasz/mcuxsdk-middleware-bootloader/targets/MIMXRT1166/src/semc_nand_flash_MIMXRT1166.c
    // Only ipg command is supported here
    status = semc_ipg_memory_read(&config->memConfig, (uint8_t *)parameterConfig, sizeof(nand_onfi_parameter_config_t), kNandDeviceReadParameter);

    return status;
}

status_t semc_nand_issue_read_status(semc_nand_config_t *config, uint8_t *SR)
{
    status_t status = kStatus_Success;
    uint32_t readoutData;
    uint16_t commandCode;
    uint32_t slaveAddress;

    // Note: If there is only one plane per target, the READ STATUS (70h) command can be used
    //   to return status following any NAND command.
    // Note: In devices that have more than one plane per target, during and following interleaved
    //  die (multi-plane) operations, the READ STATUS ENHANCED command must be used to select the
    //  die (LUN) that should report status.
    if (config->statusCommandType == kSemcNandStatusCommandType_Enhanced)
    {
        if (s_nandOperationInfo.commandSet == kNandDeviceCmdSet_Specific)
        {
            // READ MULTI-PLANE STATUS command is accepted by device even when it is busy (RDY = 0).
            commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_SPEC_ReadStatusMultiPlane,
                                                         SEMC_IPCMD_NAND_AM_COL_ROW_ADDR,  // Don't care
                                                         SEMC_IPCMD_NAND_CM_IPG_CMD_READ); // Commmand Read
            slaveAddress = config->memConfig.nandMemConfig.ipgMemBaseAddress;
        }
        else
        {
            // READ STATUS ENHANCED command is accepted by all planes in device even when they are busy (RDY = 0).
            commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_ReadStatusEnhanced,
                                                         SEMC_IPCMD_NAND_AM_ROW_ADDR_3BYTE,     // 3 Byte-RA0/RA1/RA2
                                                         SEMC_IPCMD_NAND_CM_IPG_CMD_ADDR_READ); // Commmand Address Read
            slaveAddress = s_nandOperationInfo.rowAddressToGetSR;
        }
    }
    else
    {
        // READ STATUS command is accepted by device even when it is busy (RDY = 0).
        commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_ReadStatus,
                                                     SEMC_IPCMD_NAND_AM_COL_ROW_ADDR,  // Don't care
                                                     SEMC_IPCMD_NAND_CM_IPG_CMD_READ); // Commmand Read

        // Note: For those command without address, the address should be valid as well,
        //  it shouldn't be out of IPG memory space, or SEMC IP will ignore this command.
        slaveAddress = config->memConfig.nandMemConfig.ipgMemBaseAddress;
    }
    status = semc_ipg_command_nand_access(slaveAddress, commandCode, 0, &readoutData);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Set SR value according to readout data from Device
    *SR = (uint8_t)readoutData;

    return kStatus_Success;
}

// ready for check which is modified to be used to fit read page code
status_t semc_nand_wait_for_device_ready(semc_nand_config_t *config)
{
    status_t status = kStatus_Success;
    uint8_t readyCheckIntervalInUs = s_nandOperationInfo.pageReadTimeInUs_tR_ECC;
    uint64_t deltaTicks;
    uint64_t baseTicks = microseconds_get_ticks();
    uint64_t timeoutTicks = microseconds_convert_to_ticks(config->readyCheckTimeoutInMs * 1000);

    deltaTicks = microseconds_get_ticks() - baseTicks;
    if (deltaTicks > timeoutTicks)
    {
        return kStatus_SemcNAND_DeviceTimeout;
    }

    /*
     * when internal ecc is enabled, readyCheckIntervalInUs is tR_ECC
     * when internal ecc is disabled, readyCheckIntervalInUs is tR
     */
    if (config->eccCheckType == kSemcNandEccCheckType_SoftwareECC)
    {
        readyCheckIntervalInUs = (config->readyCheckIntervalInUs > s_nandOperationInfo.pageReadTimeInUs_tR) ?
                                     config->readyCheckIntervalInUs : s_nandOperationInfo.pageReadTimeInUs_tR;
    }
    else if (config->eccCheckType == kSemcNandEccCheckType_DeviceECC)
    {
        readyCheckIntervalInUs = s_nandOperationInfo.pageReadTimeInUs_tR_ECC;
    }

    if (config->readyCheckOption == kSemcNandReadyCheckOption_SR)
    {
        uint8_t SR = 0;
        microseconds_delay(readyCheckIntervalInUs);
        if (config->eccCheckType == kSemcNandEccCheckType_SoftwareECC)
        {
            status = semc_nand_issue_read_status(config, &SR);
            if (status != kStatus_Success)
            {
                return status;
            }

            /*
             * SR[0] = 0: successful
             * SR[0] = 1: fail
             */
            if (SR & 0x1)
            {
                return kStatus_SemcNAND_ReadError;
            }

            // READ MODE command must be issued before starting folowing read cycles.
            status = semc_nand_issue_read_mode(config);
            if (status != kStatus_Success)
            {
                return status;
            }
        }
    }
    else if (config->readyCheckOption == kSemcNandReadyCheckOption_RB)
    {
        while(!semc_is_nand_ready());
    }

    return kStatus_Success;
}

status_t semc_nand_issue_read_page(semc_nand_config_t *config, uint32_t ipgCmdAddr)
{
    status_t status = kStatus_Success;
    uint32_t readyCheckIntervalInUs;
    uint32_t dummyData = 0;

    // READ PAGE command is accepted by the device when it is ready (RDY = 1, ARDY = 1).
    status = semc_nand_wait_for_ready(config, NAND_READY_CHECK_INTERVAL_NORMAL, kNandReadyCheckUseCase_DuringCommand);
    if (status != kStatus_Success)
    {
        return status;
    }

    // SA = pageIndex * pageDataSize;
    // CA = SA[COL-1:0], RA = SA[31:COL]
    // For Specific device with specific addressing and command set
    if (s_nandOperationInfo.commandSet == kNandDeviceCmdSet_Specific)
    {
        uint16_t commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_SPEC_ReadPage1stHalf,
                                                              SEMC_IPCMD_NAND_AM_COL_ROW_ADDR,  // Address value
                                                              SEMC_IPCMD_NAND_CM_IPG_CMD_ADDR); // Command Address
        status = semc_ipg_command_nand_access(ipgCmdAddr, commandCode, 0, &dummyData);
        if (status != kStatus_Success)
        {
            return status;
        }
    }
    // For other ONFI devices (ONFI Compliant, ONFI-like)
    else
    {
        uint16_t commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_ReadPageSetup,
                                                              SEMC_IPCMD_NAND_AM_COL_ROW_ADDR,  // Address value
                                                              SEMC_IPCMD_NAND_CM_IPG_CMD_ADDR); // Command Address
        status = semc_ipg_command_nand_access(ipgCmdAddr, commandCode, 0, &dummyData);
        if (status != kStatus_Success)
        {
            return status;
        }

        commandCode = semc_ipg_command_get_nand_code(kNandDeviceCmd_ONFI_ReadPageConfirm,
                                                     SEMC_IPCMD_NAND_AM_COL_ROW_ADDR,  // Don't care
                                                     SEMC_IPCMD_NAND_CM_IPG_CMD_HOLD); // Commmand Hold
        status = semc_ipg_command_nand_access(ipgCmdAddr, commandCode, 0, &dummyData);
        if (status != kStatus_Success)
        {
            return status;
        }
    }

