iwasz/mcuxsdk-middleware-bootloader/targets/MIMXRT1166/src/semc_nand_flash_MIMXRT1166.c
    return status;
}

bool semc_nand_is_software_ecc_check_passed(semc_nand_config_t *config, uint32_t baseAddress)
{
    bool isEccPassed = true;

    if ((config->enableEccCheck == kSemcNandEccCheckOption_Enabled) &&
        (config->eccCheckType == kSemcNandEccCheckType_SoftwareECC))
    {
        // Validate data using ECC parity data
        if (config->swEccAlgorithm == kSemcNandSwEccAlgorithm_SEC_HammingCode)
        {
            uint32_t eccIndex = 0;
            uint32_t eccBlocks = config->bytesInPageDataArea / config->swEccBlockBytes;
            uint8_t *nandData = s_nandReadbackBlockBuffer;
            uint32_t eccBlockStartAddress = baseAddress;
            if (config->memConfig.accessCommandType == kSemcAccessCommandType_AXI32CMD)
            {
                eccBlockStartAddress = baseAddress - config->memConfig.nandMemConfig.axiMemBaseAddress;
            }
            while (eccIndex < eccBlocks)
            {
                uint32_t dstEccIndex = (eccBlockStartAddress % config->bytesInPageDataArea) / config->swEccBlockBytes;
                if (dstEccIndex == eccIndex)
                {
                    // Only if it is not a blank block (either main or spare block), then we will check SW ECC.
                    // So the behavior could be aligned with HW ECC
                    if ((!semc_nand_is_mem_blank((uint32_t)nandData, config->swEccBlockBytes)) ||
                        (!s_nandOperationInfo.isBlankSpareArea))
                    {
                        status_t status =
                            nand_ecc_sec_verify_correct((nand_ecc_block_size_t)config->swEccBlockBytes, nandData,
                                                        (uint8_t *)&s_nandCommEccParityData.block[eccIndex]);
                        if ((status != kStatus_NandECC_NoBitErrorDetected) &&
                            (status != kStatus_NandECC_SingleBitErrorCorrected))
                        {
                            isEccPassed = false;
                            break;
                        }
                    }
                    nandData += config->swEccBlockBytes;
                    if (nandData >= (s_nandReadbackBlockBuffer + sizeof(s_nandReadbackBlockBuffer)))
                    {
                        break;
                    }
                    else
                    {
                        eccBlockStartAddress += config->swEccBlockBytes;
                    }
                }
                eccIndex++;
            }
        }
    }

    return isEccPassed;
}

status_t semc_nand_write_ecc_data_in_spare_area(semc_nand_config_t *config,
                                                uint32_t baseAddress,
                                                uint8_t *nandData,
                                                uint32_t length)
{
    status_t status = kStatus_Success;

    if ((config->enableEccCheck == kSemcNandEccCheckOption_Enabled) &&
        (config->eccCheckType == kSemcNandEccCheckType_SoftwareECC))
    {
        nand_comm_ecc_parity_data_t eccParityData;
        uint32_t eccBlocks = config->bytesInPageDataArea / config->swEccBlockBytes;
        uint32_t spareAreaStart;
        uint32_t spareAreaArray[NAND_SPARE_AREA_MAX_SIZE / 4];

        assert(config->bytesInPageSpareArea < sizeof(spareAreaArray));

        // Cleanup eccParityData
        memset((uint8_t *)&eccParityData, 0, sizeof(nand_comm_ecc_parity_data_t));

        // Calculate ECC parity data
        if (config->swEccAlgorithm == kSemcNandSwEccAlgorithm_SEC_HammingCode)
        {
            uint32_t eccIndex = 0;
            uint32_t requiredBytes = length;
            uint32_t payloadedBytes = 0;
            uint8_t *srcNandData = nandData;
            bool isAllBlankPayload = false;

            assert(!(sizeof(s_nandReadbackBlockBuffer) / config->swEccBlockBytes));
            while (eccIndex < eccBlocks)
            {
                uint32_t eccCode = 0;
                if (requiredBytes)
                {
                    srcNandData = nandData + payloadedBytes;
                    // Calculate data from src buffer (all src bytes)
                    if (requiredBytes >= config->swEccBlockBytes)
                    {
                        requiredBytes -= config->swEccBlockBytes;
                    }
                    else
                    {
                        // Calculate data from ReadbackBlockBuffer (src bytes + 0xFFu bytes)
                        memcpy(s_nandReadbackBlockBuffer, srcNandData, requiredBytes);
                        memset(&s_nandReadbackBlockBuffer[requiredBytes], NAND_MEM_BLANK_VALUE,
                               config->swEccBlockBytes - requiredBytes);
                        srcNandData = &s_nandReadbackBlockBuffer[0];
                        requiredBytes = 0;
                    }
                }
                else if (!isAllBlankPayload)
                {
                    // Calculate data from ReadbackBlockBuffer (all 0xFFu bytes)
                    memset(s_nandReadbackBlockBuffer, NAND_MEM_BLANK_VALUE, config->swEccBlockBytes);
                    srcNandData = &s_nandReadbackBlockBuffer[0];
                    isAllBlankPayload = true;
                }

                nand_ecc_sec_calculate_encode((nand_ecc_block_size_t)config->swEccBlockBytes, srcNandData,
                                              (uint8_t *)&eccCode);
                eccParityData.block[eccIndex] = eccCode;
                eccIndex++;
                payloadedBytes += config->swEccBlockBytes;
            }
        }
        // Fill in spare area array with ECC parity data
        {
            assert(eccBlocks <= NAND_ECC_MAX_BLOCKS);
            nand_page_spare_area_t *spareArea = (nand_page_spare_area_t *)spareAreaArray;
            uint32_t eccIndex = 0;
            memset(spareArea, kNandDeviceInfo_NonBadBlockMark_x8, sizeof(spareAreaArray));
            while (eccIndex < eccBlocks)
            {
                spareArea->unit8Byte[eccIndex].eccParityData = eccParityData.block[eccIndex];
                eccIndex++;
            }
        }

        // Write ECC parity data to device spare area
        if (config->memConfig.accessCommandType == kSemcAccessCommandType_AXI32CMD)
        {
            spareAreaStart = baseAddress + config->bytesInPageDataArea;
            status = semc_axi_memory_write(spareAreaStart, (uint8_t *)spareAreaArray, config->bytesInPageSpareArea);
        }
        else if (config->memConfig.accessCommandType == kSemcAccessCommandType_IPBUSCMD)
        {
            status = semc_ipg_memory_write(&config->memConfig, (uint8_t *)spareAreaArray, config->bytesInPageSpareArea, kNandDeviceWritePage);
        }
    }

