iwasz/mcuxsdk-middleware-bootloader/targets/MIMXRT1166/src/semc_nand_flash_MIMXRT1166.c
    return status;
}

// Initialize Parallel NAND Flash device
status_t semc_nand_flash_init(semc_nand_config_t *config)
{
    status_t status;

    // Cleanup operation info
    memset((uint8_t *)&s_nandOperationInfo, 0, sizeof(s_nandOperationInfo));

    s_nandOperationInfo.pageReadTimeInUs_tR = 25;
    s_nandOperationInfo.pageReadTimeInUs_tR_ECC = 45; // typical time 45us
    s_nandOperationInfo.PageProgramTimeInUs_tPROG = 600;
    s_nandOperationInfo.blockEraseTimeInUs_tBERS = 3000;

    // Set Command set
    if (config->onfiVersion != kNandOnfiVersion_None)
    {
        s_nandOperationInfo.commandSet = kNandDeviceCmdSet_OnfiCompliant;
    }
    else
    {
        switch (config->memConfig.nandMemConfig.arrayAddressOption)
        {
            // Note: Some device use ONFI-like addressing and command set, but it is not ONFI
            //  compliant device, such as Toshiba TC58xx.
            case kSemcNandAddressOption_5byte_CA2RA3:
            case kSemcNandAddressOption_4byte_CA2RA2:
            case kSemcNandAddressOption_3byte_CA2RA1:
                s_nandOperationInfo.commandSet = kNandDeviceCmdSet_OnfiLike;
                break;
            // Note: Some device use specific addressing and command set, and of course it is
            //    not ONFI compliant device, such as Samsung K9F12xx.
            case kSemcNandAddressOption_4byte_CA1RA3:
            case kSemcNandAddressOption_3byte_CA1RA2:
            case kSemcNandAddressOption_2byte_CA1RA1:
            default:
                s_nandOperationInfo.commandSet = kNandDeviceCmdSet_Specific;
                break;
        }
    }

    // Reset columnAddressOption parameter if needed
    if ((config->enableEccCheck == kSemcNandEccCheckOption_Enabled) &&
        (config->eccCheckType == kSemcNandEccCheckType_SoftwareECC))
    {
        config->memConfig.nandMemConfig.columnAddressOption = kSemcNandColumnAddressOption_SpareAreaAccess;
    }
    else
    {
        config->memConfig.nandMemConfig.columnAddressOption = kSemcNandColumnAddressOption_PageAreaAccess;
    }

    // Set AC timing parameter
    semc_nand_set_ac_timing_parameter(config, kNandAcTimingSetOption_Basic);

    // Init SEMC module
    status = semc_init((semc_mem_config_t *)&config->memConfig);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Try to read parameter page from device if it is ONFI compliant
    if (s_nandOperationInfo.commandSet == kNandDeviceCmdSet_OnfiCompliant)
    {
        // Issues the RESET command to device, make sure that we have clean NAND device status
        status = semc_nand_issue_reset(config);
        if (status != kStatus_Success)
        {
            return status;
        }

        // Just try to read ONFI parameter once
        status = semc_nand_make_use_of_onfi_parameter(config);
        if (status != kStatus_Success)
        {
            return status;
        }

        debug_printf("config->acTimingTableIndex = %d\n", config->acTimingTableIndex);

        // Set AC timing parameter again
        semc_nand_set_ac_timing_parameter(config, kNandAcTimingSetOption_Advanced);
        // Reset specific tWHR parameter if needed
        // semc_nand_adjust_timing_parameter_ccs(config);

        if ((s_nandOperationInfo.onfiAcTimingModeCode > kNandDeviceFeature_ONFI_TimingModeCode_Mode0) &&
            (s_nandOperationInfo.onfiAcTimingModeCode <= kNandDeviceFeature_ONFI_TimingModeCode_Mode5))
        {
            // Switch to specific timing mode
            status = semc_nand_switch_device_timing_mode(config);
            if (status != kStatus_Success)
            {
                return status;
            }
        }

        // Re-Init SEMC module using new parameter
        status = semc_init((semc_mem_config_t *)&config->memConfig);
        if (status != kStatus_Success)
        {
            return status;
        }

        /* read nand id */
        status = semc_nand_issue_read_id(config, &s_nandOnfiIdConfig);
        if (status != kStatus_Success)
        {
            return status;
        }
    }

    // Enable/Disable device ECC if necessary
    if (config->enableEccCheck == kSemcNandEccCheckOption_Enabled)
    {
        if (config->eccCheckType == kSemcNandEccCheckType_DeviceECC)
        {
            status = semc_nand_set_device_ecc(config, kSemcNandDeviceEccStatus_Enabled);
            if (status != kStatus_Success)
            {
                return status;
            }
        }
        else if (config->eccCheckType == kSemcNandEccCheckType_SoftwareECC)
        {
            status = semc_nand_set_device_ecc(config, kSemcNandDeviceEccStatus_Disabled);
            if (status != kStatus_Success)
            {
                return status;
            }
        }
    }

    return status;
}

//!@brief Read page data from Parallel NAND via SEMC
status_t semc_nand_flash_read_page(semc_nand_config_t *config, uint32_t pageIndex, uint8_t *buffer, uint32_t length)
{
    status_t status = kStatus_Success;
    uint32_t ipgCmdAddr, memoryAccessAddr;
    uint32_t eccCheckedByte;

    ipgCmdAddr = pageIndex * config->bytesInPageDataArea;
    // Validate given page address
    if (ipgCmdAddr >= config->memConfig.nandMemConfig.ipgMemSizeInByte)
    {
        return kStatus_SemcNAND_InvalidMemoryAddress;
    }

    // Validate given length
    if (length > config->bytesInPageDataArea)
    {
        return kStatus_SemcNAND_MoreThanOnePageSize;
    }

    // Calculate the slave address for ipg command
    // Note NA2.0: the below ipgCmdAddr must be byte address no matter it is x8
    //  or x16 device, see Note NA1.1 for reason
    ipgCmdAddr = semc_ipg_command_convert_nand_address(&config->memConfig, ipgCmdAddr);
    s_nandOperationInfo.rowAddressToGetSR = ipgCmdAddr;

    memoryAccessAddr = ipgCmdAddr;
    if (config->memConfig.accessCommandType == kSemcAccessCommandType_AXI32CMD)
    {
        memoryAccessAddr = config->memConfig.nandMemConfig.axiMemBaseAddress;
        // Issues the page read command to device
        status = semc_nand_issue_read_page(config, ipgCmdAddr);
        if (status != kStatus_Success)
        {
            return status;
        }
    }
    else if (config->memConfig.accessCommandType == kSemcAccessCommandType_IPBUSCMD)
    {
        memoryAccessAddr = ipgCmdAddr;
        // Issues the page read command to device
        status = semc_nand_issue_read_page(config, ipgCmdAddr);
        if (status != kStatus_Success)
        {
            return status;
        }
    }

    // Check NAND Device ECC status if applicable
    if (!semc_nand_is_device_ecc_check_passed(config))
    {
        return kStatus_SemcNAND_EccCheckFail;
    }

