iwasz/mcuxsdk-middleware-bootloader/targets/MIMXRT1166/src/semc_nand_flash_MIMXRT1166.c
    // Read all software ECC codes from spare area if applicable
    status = semc_nand_read_software_ecc_code_from_spare_area(config, memoryAccessAddr);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Read Page data from device
    while (length)
    {
        // Note: the memory address(row, column address) is always assigned by ipg commmand,
        //    the given address for axi command is just byte offset of available page array.
        if (config->memConfig.accessCommandType == kSemcAccessCommandType_AXI32CMD)
        {
            status =
                semc_axi_memory_read(memoryAccessAddr, s_nandReadbackBlockBuffer, sizeof(s_nandReadbackBlockBuffer));
            if (status != kStatus_Success)
            {
                return status;
            }
        }
        else if (config->memConfig.accessCommandType == kSemcAccessCommandType_IPBUSCMD)
        {
            status = semc_ipg_memory_read(&config->memConfig, (uint8_t *)s_nandReadbackBlockBuffer,
                                          sizeof(s_nandReadbackBlockBuffer), kNandDeviceReadPageData);
            if (status != kStatus_Success)
            {
                return status;
            }
        }

        // Check NAND Software ECC status if applicable
        if (!semc_nand_is_software_ecc_check_passed(config, memoryAccessAddr))
        {
            return kStatus_SemcNAND_EccCheckFail;
        }

        // Copy temp readback data to user buffer
        if (length >= sizeof(s_nandReadbackBlockBuffer))
        {
            eccCheckedByte = sizeof(s_nandReadbackBlockBuffer);
        }
        else
        {
            eccCheckedByte = length;
        }
        memcpy(buffer, s_nandReadbackBlockBuffer, eccCheckedByte);

        if (UINT32_MAX - memoryAccessAddr < eccCheckedByte)
        {
            status = kStatus_OutOfRange;
            break;
        }
        memoryAccessAddr += eccCheckedByte;

        if (UINT32_MAX - (uint32_t)buffer < eccCheckedByte)
        {
            status = kStatus_OutOfRange;
            break;
        }
        buffer += eccCheckedByte;

        if (length < eccCheckedByte)
        {
            status = kStatus_OutOfRange;
            break;
        }
        length -= eccCheckedByte;
    }

    return status;
}

//!@brief Program page data to Parallel NAND via SEMC
status_t semc_nand_flash_page_program(semc_nand_config_t *config, uint32_t pageIndex, uint8_t *src, uint32_t length)
{
    status_t status = kStatus_Success;
    uint32_t memoryAccessAddr = 0;
    uint32_t ipgCmdAddr = pageIndex * config->bytesInPageDataArea;

    // Validate given page address
    if (ipgCmdAddr >= config->memConfig.nandMemConfig.ipgMemSizeInByte)
    {
        return kStatus_SemcNAND_InvalidMemoryAddress;
    }

    // Validate given length
    if (length > config->bytesInPageDataArea)
    {
        return kStatus_SemcNAND_MoreThanOnePageSize;
    }

    // Calculate the slave address for ipg command
    // Note NA2.1: the below ipgCmdAddr must be byte address no matter it is x8
    //  or x16 device, see Note NA1.1 for reason
    ipgCmdAddr = semc_ipg_command_convert_nand_address(&config->memConfig, ipgCmdAddr);
    s_nandOperationInfo.rowAddressToGetSR = ipgCmdAddr;
    if (config->memConfig.accessCommandType == kSemcAccessCommandType_AXI32CMD)
    {
        memoryAccessAddr = config->memConfig.nandMemConfig.axiMemBaseAddress;
    }
    else if (config->memConfig.accessCommandType == kSemcAccessCommandType_IPBUSCMD)
    {
        memoryAccessAddr = ipgCmdAddr;
    }

    // Issues the page program command to device
    status = semc_nand_issue_program_page(config, ipgCmdAddr, kNandDeviceProgramProcess_Pre);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Write Page data to device
    // Note: the memory address(row, column address) is always assigned by ipg commmand,
    //    the given address for axi command is just byte offset of available page array.
    {
        uint32_t requiredBytes = length;
        uint32_t payloadedBytes = 0;
        uint8_t *writeSrc;
        bool isAllBlankPayload = false;

        assert(!(config->bytesInPageDataArea / sizeof(s_nandReadbackBlockBuffer)));
        while (payloadedBytes < config->bytesInPageDataArea)
        {
            uint32_t writeBytes;
            if (requiredBytes)
            {
                if (requiredBytes >= sizeof(s_nandReadbackBlockBuffer))
                {
                    // Cache data from src buffer (all src bytes)
                    writeBytes =
                        (requiredBytes / sizeof(s_nandReadbackBlockBuffer)) * sizeof(s_nandReadbackBlockBuffer);
                    writeSrc = src;
                    requiredBytes -= writeBytes;
                }
                else
                {
                    // Cache data from ReadbackBlockBuffer (src bytes + 0xFFu bytes)
                    writeBytes = sizeof(s_nandReadbackBlockBuffer);
                    writeSrc = src + payloadedBytes;
                    memcpy(s_nandReadbackBlockBuffer, writeSrc, requiredBytes);
                    memset(&s_nandReadbackBlockBuffer[requiredBytes], NAND_MEM_BLANK_VALUE, writeBytes - requiredBytes);
                    writeSrc = &s_nandReadbackBlockBuffer[0];
                    requiredBytes = 0;
                }
            }
            else if (!isAllBlankPayload)
            {
                // Cache data from ReadbackBlockBuffer (all 0xFFu bytes)
                writeBytes = sizeof(s_nandReadbackBlockBuffer);
                memset(s_nandReadbackBlockBuffer, NAND_MEM_BLANK_VALUE, writeBytes);
                writeSrc = &s_nandReadbackBlockBuffer[0];
                isAllBlankPayload = true;
            }

            // Write cached data to NAND device
            if (config->memConfig.accessCommandType == kSemcAccessCommandType_AXI32CMD)
            {
                status = semc_axi_memory_write(memoryAccessAddr + payloadedBytes, writeSrc, writeBytes);
            }
            else if (config->memConfig.accessCommandType == kSemcAccessCommandType_IPBUSCMD)
            {
                status = semc_ipg_memory_write(&config->memConfig, writeSrc, writeBytes, kNandDeviceWritePage);
            }
            if (status != kStatus_Success)
            {
                return status;
            }

            payloadedBytes += writeBytes;
        }
    }

    // Prepare NAND Software ECC data if applicable
    status = semc_nand_write_ecc_data_in_spare_area(config, memoryAccessAddr, src, length);
    if (status != kStatus_Success)
    {
        return status;
    }

